export const bankOptions = [
  {
    value: "پاسارگاد 1-10706567-110-284 پاسداران - جاري",
    label: "پاسارگاد - پاسداران",
  },
  { value: "تجارت 1416066538 مرکزي ساوه - جاري", label: "تجارت - مرکزي ساوه" },
  {
    value: "صادرات 0102171481006 مرکزي ساوه - جاري",
    label: "صادرات - مرکزي ساوه",
  },
  { value: "ملت 3385356379 سروغربي- قرض الحسنه جاري", label: "ملت - سروغربي" },
  {
    value: "ملت 4621823449 مرکزي ساوه - قرض الحسنه جاري",
    label: "ملت - مرکزي ساوه",
  },
  { value: "ملي 0109821280001 پاسداران - جاري", label: "ملي - پاسداران" },
  {
    value: "پارسيان 20100943668605 بلوار پروين تهران - قرض الحسنه جاري",
    label: "پارسيان - پروين تهران",
  },
  { value: "صندوق جاويد 5026100391", label: "صندوق جاويد" },
  { value: "تجارت 1019399873 نوبنياد - جاري", label: "تجارت - نوبنياد" },
  { value: "تجارت 177001820893 درياي نور - جاري", label: "تجارت - درياي نور" },
  { value: "سامان 1-42548-40-805 - جاري", label: "سامان" },
  { value: "صندوق کارآفريني اميد- ساوه", label: "کارآفريني اميد - ساوه" },
  {
    value: "اقتصاد نوين 1-5008500-2-125 بهارستان",
    label: "اقتصاد نوين - بهارستان",
  },
];
