// لیست کد بانک‌ها
const bankCodeMap: Record<string, string> = {
  "010": " مرکزی",
  "011": " صنعت و معدن",
  "012": " اقتصاد نوین",
  "013": " توسعه صادرات",
  "014": " پارسیان",
  "015": " کارآفرین",
  "016": " سامان",
  "017": " پاسارگاد",
  "018": " سرمایه",
  "019": " سینا",
  "020": " خاورمیانه",
  "021": " شهر",
  "022": " دی",
  "023": " صادرات ایران",
  "024": " ملت",
  "025": " تجارت",
  "026": " رفاه کارگران",
  "027": " کشاورزی",
  "028": " مسکن",
  "029": " توسعه تعاون",
  "030": "پست  ایران",
  "031": " قرض‌الحسنه مهر ایران",
  "032": " ایران زمین",
  "033": " قوامین (ادغام‌شده)",
  "034": " حکمت ایرانیان (ادغام‌شده)",
  "035": " گردشگری",
  "036": " ایران‌ونزوئلا",
  "037": " مشترک ایران-عمان",
  // می‌تونی ادامه بدی یا از API بانک مرکزی بگیری
};

// تابع استخراج نام بانک از شماره شبا
export function getBankNameFromIBAN(iban: string): string {
  const cleaned = iban.replace(/\s+/g, "").toUpperCase();
  if (!/^IR\d{24}$/.test(cleaned)) {
    return "شماره شبا معتبر نیست";
  }

  const bankCode = cleaned.substring(4, 7); // سه رقم بعد از IR و رقم کنترل
  return bankCodeMap[bankCode] ?? `بانک ناشناس (کد ${bankCode})`;
}
